Repository: jwsscott777/WeldHandbook
Catalog: WeldHandbook/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fil_ph, ht, pt_br, zh_hans

source: 2. Preparation of Tungsten Electrode: * Choose the appropriate tungsten type based on the metal (e.g., pure tungsten for aluminum, thoriated for steel). * Grind the tungsten electrode to a point; the grind marks should run parallel to the length of the electrode for optimal arc stability. 3. Filler Wire Selection (as per AWS guidelines): * Choose a filler metal from the AWS A5.X series that matches the base metal and desired weld properties. * Ensure the diameter of the filler rod is appropriate for the material thickness and joint type. 4. Setup of Torch & Controls: * Assemble the torch with the right collet, collet body, and nozzle size for the tungsten and welding application. * Set the machine's controls: * For polarity, use DCEN for most metals, and AC for aluminum and magnesium. * Adjust balance control (on AC machines) to control the cleaning vs. penetration effect on aluminum. * This adjustment basically controls how much the AC sine wave favors DCRP or DCSP - DCRP = Cleaning. DCSP = Penetration.
es_419: 2. Preparación del electrodo de tungsteno: * Elija el tipo de tungsteno apropiado según el metal (por ejemplo, tungsteno puro para aluminio, toriado para acero). * Muele el electrodo de tungsteno hasta obtener una punta; las marcas de esmerilado deben correr paralelas a la longitud del electrodo para una estabilidad óptima del arco. 3. Selección del alambre de relleno (según las pautas de AWS): * Elija un metal de aportación de la serie AWS A5.X que coincida con el metal base y las propiedades de soldadura deseadas. * Asegúrese de que el diámetro de la varilla de relleno sea apropiado para el espesor del material y el tipo de junta. 4. Configuración de la antorcha y los controles: * Ensamble la antorcha con el collar, el cuerpo del collar y el tamaño de boquilla correctos para la aplicación de tungsteno y soldadura. * Configurar los controles de la máquina: * Para la polaridad, utilice DCEN para la mayoría de los metales y CA para aluminio y magnesio. * Ajuste el control de equilibrio (en máquinas de CA) para controlar el efecto de limpieza versus penetración en el aluminio. * Este ajuste básicamente controla cuánto favorece la onda sinusoidal de CA a DCRP o DCSP - DCRP = Limpieza. DCSP = Penetración.
fil_ph: 2. Paghahanda ng Tungsten Electrode: * Piliin ang naaangkop na uri ng tungsten batay sa metal (hal., purong tungsten para sa aluminyo, thoriated para sa bakal). * Gilingin ang tungsten electrode sa isang punto; ang mga marka ng paggiling ay dapat tumakbo parallel sa haba ng elektrod para sa pinakamainam na katatagan ng arko. 3. Pinili ng Filler Wire (ayon sa mga alituntunin ng AWS): * Pumili ng filler metal mula sa AWS A5.X series na tumutugma sa base metal at ninanais na mga katangian ng weld. * Tiyakin na ang diameter ng filler rod ay angkop para sa kapal ng materyal at uri ng magkasanib na bahagi. 4. Setup ng Torch & Controls: * I-assemble ang torch gamit ang tamang collet, collet body, at laki ng nozzle para sa tungsten at welding application. * Itakda ang mga kontrol ng makina: * Para sa polarity, gamitin ang DCEN para sa karamihan ng mga metal, at AC para sa aluminum at magnesium. * Ayusin ang kontrol ng balanse (sa mga AC machine) para makontrol ang epekto ng paglilinis kumpara sa pagtagos sa aluminyo. * Ang pagsasaayos na ito ay karaniwang kinokontrol kung gaano kalaki ang pinapaboran ng AC sine wave sa DCRP o DCSP - DCRP = Paglilinis. DCSP = Pagpasok.
ht: 2. Preparasyon nan elektwòd tengstèn: * Chwazi kalite tengstèn ki apwopriye a ki baze sou metal la (egzanp, tengstèn pi bon kalite pou aliminyòm, thoriated pou asye). * Moulen elektwòd tengstèn la nan yon pwen; mak moulen yo ta dwe kouri paralèl ak longè elektwòd la pou estabilite optimal arc. 3. Seleksyon Fil Filler (selon direktiv AWS): * Chwazi yon metal ranpli nan seri AWS A5.X ki matche ak metal debaz la ak pwopriyete soude vle. * Asire dyamèt baton filler la apwopriye pou epesè materyèl la ak kalite jwenti. 4. Enstalasyon Torch & Kontwòl: * Rasanble flanbo a ak kolye dwat la, kò kolye, ak gwosè bouch pou aplikasyon an tengstèn ak soude. * Mete kontwòl machin nan: * Pou polarite, sèvi ak DCEN pou pifò metal, ak AC pou aliminyòm ak mayezyòm. * Ajiste kontwòl balans (sou machin AC) pou kontwole efè netwayaj vs pénétration sou aliminyòm. * Ajisteman sa a fondamantalman kontwole konbyen vag sinis AC favè DCRP oswa DCSP - DCRP = Netwayaj. DCSP = Pénétration.
pt_br: 2. Preparação do eletrodo de tungstênio: * Escolha o tipo de tungstênio apropriado com base no metal (por exemplo, tungstênio puro para alumínio, toriado para aço). * Moa o eletrodo de tungstênio até a ponta; as marcas de moagem devem ficar paralelas ao comprimento do eletrodo para uma estabilidade ideal do arco. 3. Seleção do fio de enchimento (de acordo com as diretrizes da AWS): * Escolha um metal de adição da série AWS A5.X que corresponda ao metal base e às propriedades de solda desejadas. * Certifique-se de que o diâmetro da haste de enchimento seja apropriado para a espessura do material e tipo de junta. 4. Configuração da tocha e controles: * Monte a tocha com a pinça, corpo da pinça e tamanho de bico corretos para aplicação de tungstênio e soldagem. * Defina os controles da máquina: * Para polaridade, use DCEN para a maioria dos metais e AC para alumínio e magnésio. * Ajuste o controle de equilíbrio (em máquinas AC) para controlar o efeito de limpeza versus penetração no alumínio. * Este ajuste controla basicamente o quanto a onda senoidal AC favorece DCRP ou DCSP - DCRP = Limpeza. DCSP = Penetração.
zh_hans: 2、钨电极的制备： * 根据金属选择合适的钨类型（例如，铝用纯钨，钢用钍）。 * 将钨电极研磨至尖端；磨痕应平行于电极的长度，以获得最佳的电弧稳定性。 3. 填充焊丝选择（根据 AWS 指南）： * 从 AWS A5.X 系列中选择与母材金属和所需焊接性能相匹配的填充金属。 * 确保填充棒的直径适合材料厚度和接头类型。 4. 割炬和控制器的设置： * 为钨钢和焊接应用装配合适的夹头、夹头体和喷嘴尺寸的焊枪。 * 设置机器的控制： * 对于极性，对于大多数金属使用 DCEN，对于铝和镁使用 AC。 * 调整平衡控制（在交流机器上）以控制对铝的清洁与渗透效果。 * 此调整主要控制交流正弦波有利于 DCRP 或 DCSP 的程度 - DCRP = 清洁。 DCSP = 渗透。

source: 5. Choose and Load the Wire: * Select the appropriate wire diameter and type for your material and welding position. * Wire diameters are typical: .023", .030", .035", .045", and .062". * Make sure the drive rolls match the wire diameter you intend to use. * For steel: Use ER70s-3 or ER70s-6 - unless material requires another type. * For Aluminum: Use ER4043 or ER5356 - unless material requires another type. * Feed the wire through the drive rolls and welding gun. 6. Set Voltage and Wire Feed Speed: * Adjust the voltage and wire feed speed according to the material thickness and wire diameter. * Determine which mode of transfer you need to be in. For example: 1/4" steel using .035" is in short circuit between 14-24 volts, with a wire speed range between 75-420 ipm typically. Spray transfer will be set with this same material and wire diameter with settings over 24 volts with wire speed over 420 ipm. A different mix of shielding gas would be preferable to achieve a more accurate spray mode of transfer. 7. Test Weld & Gas Flow: * Perform a test weld on scrap material to check settings. * Adjust the gas flow rate as necessary (typically 15-25 CFH for most applications). * Tip: Ensure a consistent gas shield. Inadequate shielding can cause porosity.
es_419: 5. Elija y cargue el cable: * Seleccione el diámetro y tipo de alambre apropiado para su material y posición de soldadura. * Los diámetros de alambre son típicos: 0,023", 0,030", 0,035", 0,045" y 0,062". * Asegúrese de que los rodillos impulsores coincidan con el diámetro del alambre que desea utilizar. * Para acero: utilice ER70s-3 o ER70s-6, a menos que el material requiera otro tipo. * Para aluminio: utilice ER4043 o ER5356, a menos que el material requiera otro tipo. * Pase el alambre a través de los rodillos impulsores y la pistola de soldar. 6. Establezca el voltaje y la velocidad de alimentación del alambre: * Ajuste el voltaje y la velocidad de alimentación del alambre de acuerdo con el espesor del material y el diámetro del alambre. * Determine en qué modo de transferencia necesita estar. Por ejemplo: el acero de 1/4" usando .035" está en cortocircuito entre 14 y 24 voltios, con un rango de velocidad del cable entre 75 y 420 ipm normalmente. La transferencia por aspersión se configurará con este mismo material y diámetro de alambre con configuraciones superiores a 24 voltios y una velocidad del alambre superior a 420 ipm. Sería preferible una mezcla diferente de gas protector para lograr un modo de transferencia de pulverización más preciso. 7. Pruebe la soldadura y el flujo de gas: * Realice una prueba de soldadura en material de desecho para verificar la configuración. * Ajuste el caudal de gas según sea necesario (normalmente 15-25 CFH para la mayoría de las aplicaciones). * Consejo: Asegúrese de que haya una protección de gas consistente. Un blindaje inadecuado puede provocar porosidad.
fil_ph: 5. Piliin at I-load ang Wire: * Piliin ang naaangkop na diameter ng wire at uri para sa iyong materyal at posisyon ng hinang. * Karaniwang ang mga diameter ng wire: .023", .030", .035", .045", at .062". * Tiyaking tumutugma ang mga drive roll sa diameter ng wire na balak mong gamitin. * Para sa bakal: Gumamit ng ER70s-3 o ER70s-6 - maliban kung ang materyal ay nangangailangan ng ibang uri. * Para sa Aluminum: Gumamit ng ER4043 o ER5356 - maliban kung ang materyal ay nangangailangan ng ibang uri. * Pakanin ang wire sa pamamagitan ng mga drive roll at welding gun. 6. Itakda ang Boltahe at Bilis ng Wire Feed: * Ayusin ang boltahe at bilis ng wire feed ayon sa kapal ng materyal at diameter ng wire. * Tukuyin kung aling mode ng paglipat ang kailangan mong pasukin. Halimbawa: 1/4" na bakal gamit ang .035" ay nasa short circuit sa pagitan ng 14-24 volts, na may wire speed range sa pagitan ng 75-420 ipm karaniwang. Itatakda ang spray transfer gamit ang parehong materyal at diameter ng wire na may mga setting na higit sa 24 volts na may bilis ng wire na higit sa 420 ipm. Ang ibang halo ng shielding gas ay mas mainam upang makamit ang isang mas tumpak na spray mode ng paglipat. 7. Subukan ang Weld at Daloy ng Gas: * Magsagawa ng test weld sa scrap material upang suriin ang mga setting. * Ayusin ang rate ng daloy ng gas kung kinakailangan (karaniwang 15-25 CFH para sa karamihan ng mga aplikasyon). * Tip: Tiyakin ang isang pare-parehong gas shield. Ang hindi sapat na kalasag ay maaaring magdulot ng porosity.
ht: 5. Chwazi epi chaje fil la: * Chwazi dyamèt fil apwopriye ak kalite pou materyèl ou ak pozisyon soude. * Dyamèt fil yo tipik: .023", .030", .035", .045", ak .062". * Asire w ke woulo kondwi yo matche ak dyamèt fil ou gen entansyon itilize. * Pou asye: Sèvi ak ER70s-3 oswa ER70s-6 - sof si materyèl mande pou yon lòt kalite. * Pou aliminyòm: Sèvi ak ER4043 oswa ER5356 - sof si materyèl mande pou yon lòt kalite. * Nouri fil la nan woulo kondwi yo ak zam soude. 6. Mete vòltaj ak vitès fil kouran: * Ajiste vòltaj la ak vitès fil manje selon epesè materyèl la ak dyamèt fil. * Detèmine ki mòd transfè ou bezwen pous. Pou egzanp: 1/4 "asye lè l sèvi avèk .035" se nan kous kout ant 14-24 vòlt, ak yon seri vitès fil ant 75-420 ipm tipikman. Transfè espre yo pral mete ak menm materyèl sa a ak dyamèt fil ak anviwònman plis pase 24 vòlt ak vitès fil sou 420 ipm. Yon melanj diferan nan gaz pwoteksyon ta pi preferab pou reyalize yon mòd espre transfè ki pi egzak. 7. Tès soude ak koule gaz: * Fè yon tès soude sou materyèl bouyon pou tcheke paramèt yo. * Ajiste to koule gaz la jan sa nesesè (tipikman 15-25 CFH pou pifò aplikasyon yo). * Ide: Asire yon plak pwotèj gaz ki konsistan. Pwoteksyon ensifizan ka lakòz porosite.
pt_br: 5. Escolha e carregue o fio: * Selecione o diâmetro e tipo de fio apropriado para seu material e posição de soldagem. * Os diâmetros dos fios são típicos: 0,023", 0,030", 0,035", 0,045" e 0,062". * Certifique-se de que os rolos de acionamento correspondam ao diâmetro do fio que você pretende usar. * Para aço: Use ER70s-3 ou ER70s-6 – a menos que o material exija outro tipo. * Para Alumínio: Use ER4043 ou ER5356 - a menos que o material exija outro tipo. * Passe o fio pelos rolos de acionamento e pela pistola de soldagem. 6. Defina a tensão e a velocidade de alimentação do fio: * Ajuste a tensão e a velocidade de alimentação do fio de acordo com a espessura do material e o diâmetro do fio. * Determine em qual modo de transferência você precisa estar. Por exemplo: aço de 1/4" usando 0,035" está em curto-circuito entre 14-24 volts, com uma faixa de velocidade do fio normalmente entre 75-420 ipm. A transferência por spray será ajustada com este mesmo material e diâmetro de arame com configurações acima de 24 volts e velocidade de arame acima de 420 ipm. Uma mistura diferente de gás de proteção seria preferível para obter um modo de transferência de pulverização mais preciso. 7. Teste de soldagem e fluxo de gás: * Realize um teste de soldagem em material de sucata para verificar as configurações. * Ajuste a taxa de fluxo de gás conforme necessário (normalmente 15-25 CFH para a maioria das aplicações). * Dica: Garanta uma proteção de gás consistente. A blindagem inadequada pode causar porosidade.
zh_hans: 5. 选择并加载电线： * 根据您的材料和焊接位置选择合适的焊丝直径和类型。 * 典型线径：0.023"、0.030"、0.035"、0.045" 和 0.062"。 * 确保驱动辊与您想要使用的线材直径相匹配。 * 对于钢：使用 ER70s-3 或 ER70s-6 - 除非材料需要其他类型。 * 对于铝：使用 ER4043 或 ER5356 - 除非材料需要其他类型。 * 将焊丝送入驱动辊和焊枪。 6. 设置电压和送丝速度： * 根据材料厚度和线径调整电压和送丝速度。 * 确定您需要采用哪种传输模式。例如：使用 0.035" 的 1/4" 钢在 14-24 伏之间短路，线速范围通常在 75-420 ipm 之间。喷涂传输将采用相同的材​​料和线径，设置超过 24 伏，线速超过 420 ipm。为了实现更精确的喷涂转移模式，最好使用不同的保护气体混合物。 7. 测试焊接和气体流量： * 对废料进行测试焊接以检查设置。 * 根据需要调整气体流速（对于大多数应用，通常为 15-25 CFH）。 * 提示：确保一致的气体保护。屏蔽不充分会导致孔隙。

source: 5. Gas Selection & Flow Rate: * Use 100% argon for most metals. For some aluminum alloys, an argon-helium mix can be beneficial for increased heat input. * Set the shielding gas flow rate; typically, 15-25 cfh (cubic feet per hour) is a good starting point. 6. Amperage Setting: * Adjust the machine’s amperage based on the material thickness and tungsten size. 130 amps is a good range to start with. 90 amps is good to start with on stainless steel. * For aluminum, setting the amperage double what you would for steel is a good idea because of aluminum's ability to rapidly dissipate heat more than most other metals. Don't be afraid to crank up the amps here, if your using a remote foot pedal or bump switch. The longer you linger at the start of the weld, waiting for the metal to be ready to weld, it has probably already started to transform into it's 'Hot Shortness' nature and drop out on you. Its better to go in hot and taper down the heat with your remote control as you run your bead. 7. Remote Control Setting: * If using a foot pedal or a bump switch on the torch, set the machine to "remote" control. This provides amperage control while welding.
es_419: 5. Selección de gas y caudal: * Utilice 100% argón para la mayoría de los metales. Para algunas aleaciones de aluminio, una mezcla de argón y helio puede resultar beneficiosa para aumentar el aporte de calor. * Establecer el caudal de gas de protección; normalmente, 15 a 25 cfh (pies cúbicos por hora) es un buen punto de partida. 6. Configuración de amperaje: * Ajuste el amperaje de la máquina según el espesor del material y el tamaño del tungsteno. 130 amperios es un buen rango para empezar. 90 amperios es bueno para empezar en acero inoxidable. * Para el aluminio, establecer el amperaje al doble de lo que usaría para el acero es una buena idea debido a la capacidad del aluminio para disipar rápidamente el calor más que la mayoría de los otros metales. No tengas miedo de subir los amplificadores aquí, si estás usando un pedal remoto o un interruptor de impacto. Cuanto más se demore en el inicio de la soldadura, esperando que el metal esté listo para soldar, probablemente ya haya comenzado a transformarse en su naturaleza de "falta caliente" y se le caiga encima. Es mejor entrar en calor y reducir el calor con el control remoto mientras corres la cuenta. 7. Configuración del control remoto: * Si utiliza un pedal o un interruptor en la antorcha, configure la máquina en control "remoto". Esto proporciona control de amperaje mientras se suelda.
fil_ph: 5. Pagpili ng Gas at Rate ng Daloy: * Gumamit ng 100% argon para sa karamihan ng mga metal. Para sa ilang mga aluminyo na haluang metal, ang isang argon-helium mix ay maaaring maging kapaki-pakinabang para sa pagtaas ng input ng init. * Itakda ang shielding gas flow rate; karaniwan, ang 15-25 cfh (cubic feet per hour) ay isang magandang panimulang punto. 6. Setting ng Amperage: * Ayusin ang amperage ng makina batay sa kapal ng materyal at laki ng tungsten. Ang 130 amps ay isang magandang hanay upang magsimula. 90 amps ay magandang magsimula sa hindi kinakalawang na asero. * Para sa aluminyo, ang pagtatakda ng dobleng amperage kung ano ang gagawin mo para sa bakal ay isang magandang ideya dahil sa kakayahan ng aluminyo na mabilis na mawala ang init kaysa sa karamihan ng iba pang mga metal. Huwag matakot na i-crank up ang mga amp dito, kung gumagamit ka ng remote foot pedal o bump switch. Habang tumatagal ka sa pagsisimula ng weld, naghihintay na ang metal ay handa nang magwelding, malamang na nagsimula na itong mag-transform sa pagiging 'Hot Shortness' at mag-drop out sa iyo. Mas mainam na pumasok sa init at bawasan ang init gamit ang iyong remote control habang pinapatakbo mo ang iyong butil. 7. Setting ng Remote Control: * Kung gumagamit ng foot pedal o bump switch sa torch, itakda ang makina sa "remote" control. Nagbibigay ito ng kontrol sa amperage habang hinang.
ht: 5. Seleksyon gaz ak pousantaj koule: * Sèvi ak 100% agon pou pifò metal yo. Pou kèk alyaj aliminyòm, yon melanj agon-elyòm ka benefisye pou ogmante opinyon chalè. * Mete to koule gaz pwoteksyon an; tipikman, 15-25 cfh (pye kib pou chak èdtan) se yon bon pwen depa. 6. Anviwònman Anperaj: * Ajiste anperaj machin nan ki baze sou epesè materyèl la ak gwosè tengstèn. 130 amp se yon seri bon pou kòmanse. 90 amps se yon bon bagay pou kòmanse ak sou asye pur. * Pou aliminyòm, mete anperaj a doub sa ou ta pou asye se yon bon lide paske nan kapasite aliminyòm nan rapidman gaye chalè plis pase pifò lòt metal. Ou pa bezwen pè pou monte anpli yo isit la, si w ap itilize yon pedal aleka oswa yon switch boul. Pi long la ou retade nan kòmansman an nan soude a, ap tann pou metal la yo dwe pare yo soude, li te pwobableman deja kòmanse transfòme nan nati 'Hot Shortness' li a ak lage sou ou. Li pi bon yo ale nan cho ak koni desann chalè a ak kontwòl remote ou pandan w ap kouri chaplèt ou. 7. Anviwònman Remote Control: * Si w ap itilize yon pedal pye oswa yon switch boul sou flanbo a, mete machin nan nan kontwòl "aleka". Sa a bay kontwòl amperaj pandan y ap soude.
pt_br: 5. Seleção de gás e vazão: * Use 100% argônio para a maioria dos metais. Para algumas ligas de alumínio, uma mistura de argônio-hélio pode ser benéfica para aumentar a entrada de calor. * Ajustar a vazão do gás de proteção; normalmente, 15-25 cfh (pés cúbicos por hora) é um bom ponto de partida. 6. Configuração de amperagem: * Ajuste a amperagem da máquina com base na espessura do material e no tamanho do tungstênio. 130 amperes é uma boa faixa para começar. 90 amperes é bom para começar em aço inoxidável. * Para o alumínio, definir a amperagem para o dobro do que seria para o aço é uma boa ideia devido à capacidade do alumínio de dissipar o calor rapidamente, mais do que a maioria dos outros metais. Não tenha medo de aumentar os amplificadores aqui, se você estiver usando um pedal remoto ou um interruptor de impacto. Quanto mais você demorar no início da soldagem, esperando que o metal esteja pronto para soldar, ele provavelmente já começou a se transformar em sua natureza de 'Quertura Quente' e cair em você. É melhor entrar quente e diminuir o calor com o controle remoto enquanto você passa a conta. 7. Configuração do controle remoto: * Se estiver usando um pedal ou um interruptor de impacto na tocha, coloque a máquina no controle "remoto". Isso fornece controle de amperagem durante a soldagem.
zh_hans: 5. 气体选择及流量： * 对于大多数金属使用 100% 氩气。对于某些铝合金，氩氦混合物有利于增加热量输入。 * 设置保护气体流量；通常，15-25 cfh（立方英尺每小时）是一个不错的起点。 6.电流强度设置： * 根据材料厚度和钨尺寸调整机器的电流强度。 130 安培是一个不错的起始电流范围。对于不锈钢，从 90 安培开始是不错的选择。 * 对于铝，将安培数设置为钢的两倍是一个好主意，因为铝比大多数其他金属具有更快的散热能力。如果您使用远程脚踏板或碰撞开关，请不要害怕在这里调高放大器。您在焊接开始时等待金属准备好焊接的时间越长，它可能已经开始转变为“热脆”性质并落在您身上。最好在运行珠子时，先进入热状态，然后用遥控器逐渐降低热量。 7. 远程控制设置： * 如果使用脚踏板或割炬上的碰撞开关，请将机器设置为“远程”控制。这在焊接时提供电流强度控制。
